org-content/hugo.org
#+STARTUP: content
#+options: author:nil
#+HUGO_BASE_DIR: ../
#+hugo_level_offset: 0

** DONE Summer 2019 Internship at Harvard High Performance Computing :internship:@Retrospectives:
CLOSED: [2020-12-01]
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: summer-2019-internship-at-harvard-high-performance-computing
:EXPORT_FILE_NAME: index
:END:

*** High Level Overview

I intered at Harvard HPC for 12 weeks (High Performance Computing) the summer of 2019.

I lived with my family and would bike to and from work (about 15 minutes) each day.

My work focused around improving support for tracking client storage allocations. I was lucky to work alongside lots of awesome and brilliant colleagues. :)

*** What Did I Learn

**** Skills
- I learned Django, MySQL, and Docker
- Learned about the all of the communication involved with designing the structure of a new database.

**** Lessons
- Don't iterate through designs by coding them; instead use a tool like Figma and then code it once you settle on a design.

*** What Did I Get Done

Here is an overview of the things I was most proud of accomplishing:
- Coded a dashboard that enables Harvard FASRC clients to view, request, or terminate their storage allocations.
- Built a storage request form that helps streamline the process by which clients acquire more storage.
- Designed a MySQL database for tracking storage allocations and storage transactions.

*** COMMENT Memorable Events

Hard to remember back over a year ago unfortunately.

**** Giving Final Presentation
**** Friday Happy Hour
**** Getting My Name on the Door :)
**** Meeting with Aaron the django pro and discussing i3 vs dwm.
**** Watching volleyball and doing pushups during lunch.
**** So many friendly faces
**** Departing lunch at felipes

*** Thanks

This experience would not have been possible without the many awesome colleagues I got to work alongside. Special thanks to Raminder for being such a great mentor this past summer. This was my first software engineering internship; I wouldn't have grown and learned as much as I did without your constant feedback.
